---
kind: type
id: T:Autodesk.Revit.DB.SKPImportOptions
source: html/79e692ab-e01d-f723-158a-1951f40aa2b6.htm
---
# Autodesk.Revit.DB.SKPImportOptions

The import options used to import SKP format files.

## Syntax (C#)
```csharp
public class SKPImportOptions : BaseImportOptions
```